; domain
(define (domain logistics)
  (:requirements :strips :typing)
  
  (:types truck package location)

  (:predicates
    (at ?obj - (either truck package) ?loc - location)
    (in ?pkg - package ?trk - truck)
  )

  ;; Truck can move from one location to another
  (:action drive
    :parameters (?t - truck ?from - location ?to - location)
    :precondition (at ?t ?from)
    :effect (and (not (at ?t ?from)) (at ?t ?to))
  )

  ;; Load a package into a truck at the same location
  (:action load
    :parameters (?p - package ?t - truck ?l - location)
    :precondition (and (at ?p ?l) (at ?t ?l))
    :effect (and (not (at ?p ?l)) (in ?p ?t))
  )

  ;; Unload a package from the truck to a location
  (:action unload
    :parameters (?p - package ?t - truck ?l - location)
    :precondition (and (in ?p ?t) (at ?t ?l))
    :effect (and (not (in ?p ?t)) (at ?p ?l))
  )
)

; problem
(define (problem logistics-problem-1)
  (:domain logistics)

  (:objects
    changi tampines bedok - location
    truck1 - truck
    package1 - package
  )

  (:init
    (at truck1 tampines)
    (at package1 bedok)
  )

  (:goal
    (at package1 changi)
  )
)

; plan
1. (drive truck1 tampines bedok)
   deleted: (at truck1 tampines)
   added: (at truck1 bedok)
   goals met: 0 of 1
2. (load package1 truck1 bedok)
   deleted: (at package1 bedok)
   added: (in package1 truck1)
   goals met: 0 of 1
3. (drive truck1 bedok changi)
   deleted: (at truck1 bedok)
   added: (at truck1 changi)
   goals met: 0 of 1
4. (unload package1 truck1 changi)
   deleted: (in package1 truck1)
   added: (at package1 changi)
   goals met: 1 of 1
